Modulo_3/crypo_wallet/app/controllers/coins_controller.rb

  def index
    @coins = Coin.all
---
SELECT "coins".* FROM "coins"

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)  [["description", ""], ["acronym", ""], ["url_image", ""], ["created_at", "2020-09-17 16:49:01.333774"], ["updated_at", "2020-09-17 16:49:01.333774"], ["mining_type_id", 1]]

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["url_image", "https://e7.pngegg.com/pngimages/261/204/png-clipart-bitcoin-bitcoin.png"], ["updated_at", "2020-09-08 13:26:47.291317"], ["id", 1]]

  def destroy
    @coin.destroy
---
DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 3]]

  def set_mining_type_options
    @mining_type_options = MiningType.all.pluck(:description, :id)
---
SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"

    def set_coin
      @coin = Coin.find(params[:id])
---
SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]