Modulo_3/crypo_wallet/app/views/coins/_form.html.erb

    <%= form.label :mining_type_id %>
    <%= form.select("mining_type_id", MiningType.all.collect {|m| [m.description, m.id]}, {include_blank: 'Selecione ...'}) %>
---
SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"