Modulo_3/crypo_wallet/app/views/coins/index.html.erb

SELECT "coins".* FROM "coins"
SELECT COUNT(*) FROM "coins"
---
<p id="notice"><%= notice %></p>
<h2><%= Coin.model_name.human(count: @coins.count) %></h2>